import 'dart:io';

void main(){
  print('''Как назывался корабль Джека Воробья в "Пиратах Карибского моря"? 
  a)Мародёр
  b)Черная Жемчужина
  c)Черный питон
  d)Слизерин
  ''');
  String otvet1 = stdin.readLineSync().toString();
  int i = 0;
  if (otvet1.toLowerCase() == 'b') {
    print('Ответ верный, держи свой 1 балл');
    i++;
  }
  else{
    print('''Упал? Встань и иди дальше! Правильный ответ: b) Черная жемчужина
    -----------------------------------------------------''');
  }


  print('''
   Какая планета в нашей Солнечной системе самая большая? 
    a) Юпитер
    b) Сатурн
    c) Уран
    d) Дагестан
  ''');
  String otvet2 = stdin.readLineSync().toString();
  if (otvet2.toLowerCase() == 'a') {
    print('''Правильный ответ, держи балл
    -----------------------------------------------------''');
    i++;
  }
  else if (otvet2.toLowerCase() == 'd') {
    print('''':)Ладно держи балл за патриотизм
    -----------------------------------------------------''');
    i++;
  }
  else{
    print('''Правильный ответ: a) Юпитер
    -----------------------------------------------------''');
  }

  print('''
   Кто сыграл Нео в "Матрице"? 
    a) Бред Питт
    b) Том Круз
    c) Киану Ривз 
    d) Шахабас Гаммадов
  ''');
  String otvet3 = stdin.readLineSync().toString();
  if (otvet3.toLowerCase() == 'c') {
    print('''Да ты всезнайка!
    -----------------------------------------------------''');
    i++;
  }
  else if (otvet3.toLowerCase() == 'd') {
    print('''Нууу почти.... Думаю балл ты заслужил
    -----------------------------------------------------''');
    i ++;
  }
  else{
    print('''Правильный ответ: c) Киану Ривз
    -----------------------------------------------------''');
  }



  print('''
   Какая компания владеет Bugatti, Bentley, Lamborghini, Audi и Porsche? 
    a) BMW
    b) Mercedes
    c) FIAT 
    d) Volkswagen
  ''');
  String otvet4 = stdin.readLineSync().toString();
  if (otvet4.toLowerCase() == 'd') {
    print('''Удивительно, и это правильный ответ!
    -----------------------------------------------------''');
    i++;
  }
  else{
    print('''Правильный ответ: c) Volkswagen
    -----------------------------------------------------''');
  }

  print('''
   Какая страна является самой маленькой в мире?
    a) Мальта
    b) Мальдивы
    c) Ватикан
    d) Монако
  ''');
  String otvet5 = stdin.readLineSync().toString();
  if (otvet5.toLowerCase() == 'c') {
    print('''Отлично
    -----------------------------------------------------''');
    i++;
  }
  else{
    print('''Правильный ответ: c) Ватикан
    -----------------------------------------------------''');
  }
  print('''Подведем итоги
  Ты набрал $i баллов''');
}